test/performance/benchmarks/real-traffic-test/results/preempt-k8s/10_seconds-5_interfering/2026-02-23_23-57-18/vegeta_metrics.txt
=== Real Traffic Test Results ===


== Test Configuration ==

Services: 10
RPS: 50
Duration: 1m0s
Min Latency: 0s
Max Latency: 0s
Min Startup Latency: 0s
Max Startup Latency: 0s
Min Payload Size (bytes): 10000
Max Payload Size (bytes): 10000
Critical Test: true
Sources of Interference: 5
Interfering Namespace: interference
Bucket Node: dessertw3


== Test Results ==

= Aggregated Results =

Requests      [total, rate, throughput]         3000, 50.02, 50.01
Duration      [total, attack, wait]             59.986s, 59.98s, 5.924ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.783ms, 102.932ms, 6.249ms, 10.573ms, 358.861ms, 2.856s, 3.946s
Bytes In      [total, mean]                     29139240, 9713.08
Bytes Out     [total, mean]                     30000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:

= Per-Service Results =

# Service: perftest-0
Criticality Level: 1

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.507ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.112ms, 124.188ms, 6.394ms, 10.867ms, 757.871ms, 3.155s, 3.615s
Bytes In      [total, mean]                     2913735, 9712.45
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-1
Criticality Level: 2

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.175ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.163ms, 53.836ms, 6.351ms, 10.273ms, 21.853ms, 1.761s, 2.296s
Bytes In      [total, mean]                     2913818, 9712.73
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-2
Criticality Level: 3

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.799s, 6.485ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.178ms, 54.306ms, 6.266ms, 9.779ms, 19.955ms, 1.8s, 2.296s
Bytes In      [total, mean]                     2914260, 9714.20
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-3
Criticality Level: 4

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.902ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.226ms, 125.887ms, 6.454ms, 11.837ms, 791.952ms, 3.202s, 3.655s
Bytes In      [total, mean]                     2914234, 9714.11
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-4
Criticality Level: 5

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.799s, 6.45ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.954ms, 145.293ms, 6.087ms, 10.436ms, 1.077s, 3.492s, 3.946s
Bytes In      [total, mean]                     2914149, 9713.83
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-5
Criticality Level: 6

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.228ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.783ms, 113.302ms, 5.894ms, 9.343ms, 593.76ms, 2.996s, 3.454s
Bytes In      [total, mean]                     2914226, 9714.09
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-6
Criticality Level: 7

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.038ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.817ms, 102.091ms, 5.919ms, 10.13ms, 401.591ms, 2.79s, 3.251s
Bytes In      [total, mean]                     2913771, 9712.57
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-7
Criticality Level: 8

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.459ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.364ms, 105.945ms, 6.299ms, 11.986ms, 459.517ms, 2.859s, 3.317s
Bytes In      [total, mean]                     2912637, 9708.79
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-8
Criticality Level: 9

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.801s, 5.492ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.092ms, 107.671ms, 6.322ms, 13.051ms, 475.878ms, 2.887s, 3.342s
Bytes In      [total, mean]                     2914187, 9713.96
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-9
Criticality Level: 10

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.924ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.079ms, 96.803ms, 6.308ms, 9.521ms, 306.883ms, 2.652s, 3.16s
Bytes In      [total, mean]                     2914223, 9714.08
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set: